import { Component } from '@angular/core';
import { NavController } from 'ionic-angular';

@Component({
  selector: 'page-home',
  templateUrl: 'home.html'
})
export class HomePage {
  details=[
    {
      title:'अंतर्राष्ट्रीय हिन्दू परिषद्',
      shortdec:'दृष्टिकोण (Vision ) : हिन्दू ही आगे लक्ष्य ( Goal ) :हिन्दू समृद्धि , सुरक्षा और सम्मान ',
      longdesc:`<p>१. देश विदेश के हर जाती, भाषा, राज्य, पंथ, वर्ग, सामाजिक-आर्थिक स्थिति , व्यवसाय, लिंग के हर हिंदुओंकी सांस्कृतिक /धार्मिक/व्यक्तिगत / पारिवारिक / सामाजिक / आर्थिक / राजनितिक आकांक्षाओं और अधिकारों के लिए आवाज / मंच / समर्थन और बल देना |
      </p><p>२. छुआछूतमुक्त भारत और समरस , जातिभेद मुक्त समाज का उद्देश्य लेकर कार्य आगे बढ़ाना |
      </p><p>३. किसी भी समाज और देश के संवैधानिक और सामाजिक रचनाओं में कुछ प्रणालियाँ ( Systems ) पराम् महत्व रखती है | उन का व्यक्ति के समाज के धर्म और देश के संपूर्ण जीवन पर नियंत्रण / प्रभाव होता है | ये है : न्यायव्यवस्था , शिक्षा व्यवस्था , परिवार, सरकार और धर्म - आस्था - संस्कृति | इन सभी पांचो में " हिन्दू ही आगे " का लक्ष्य लेकर सभी तबकों के और अजीविकाओंके सभी हिन्दुओं की समृद्धि , सुरक्षा और सम्मान सुनिश्चित करना |</p>`,
      img:'assets/imgs/6.jpg'
    },
    {
      title:'राष्ट्रीय बजरंग दल',
      shortdec:`भारत में युवा जनसँख्या अधिक है और उनमे बहुसंख्या हिन्दू है | जैसे पहले ही कहा, हर व्यक्ति के व्यक्तिगत , सामाजिक, आर्थिक, धार्मिक, राष्ट्रीय और राजनितिक इन सभी क्षेत्रों में विचार होते हैं , अनुभव होते है और आकांक्षाएं होती है| देश का दायित्व है कीं उन्हें m पूर्ण करने में सभी आगे आए  |`,
      longdesc:`<p>१. हिन्दुओं के स्थानीय और राष्ट्रीय / सांस्कृतिक अनेकों आयाम और विषय होते है | हिन्दुओं द्वारा पूज्य मंदिर , गौमाता , मुर्तिया, शब्द , कविता, भगवान और देविया , ऐतिहासिक / वर्तमान के सन्माननीय व्यक्ति जैसे महाराणा प्रताप, छत्रपति शिवजी महाराज, गुरु गोविंदसिंह , झांसी की रानी लक्ष्मीबाई, पूज्य अहिल्ल्यादेवी होल्कर, लाचित बरफुकान, वीर भगतसिंघ - सुखदेव और राजगुरु, स्वामी विवेकानंद, सरदार पटेल, डॉ . बाबासाहेब आंबेडकर , स्वातंत्र्य वीर सावरकर, महात्मा फुले और अन्य ऐसे अनेकों पूजनीय |
      </p><p>२. छुआछूतमुक्त भारत और समरस , जातिभेद मुक्त समाज का उद्देश्य लेकर कार्य आगे बढ़ाना |
      </p><p>३, युवाओंको उद्यमी, कुशलता और नेतृत्व प्रशिक्षण देना |
      </p><p>४. अन्य देशों में बेस हिन्दू युवाओंको भारत की संस्कृति, धर्म , परंपरा और आधुनिक प्रगति से परिचित करना और भारत के युवाओंको उनसे जोड़ना.
      </p><p>५. हिन्दू हीत, हिन्दू समाज और देश भर में  बसे  हिन्दुओं के विविध मुद्दे इनके लिए राष्ट्रीय बजरंग दल खड़ा रहेगा |</p>`,
      img:'assets/imgs/1.jpg'
    },
    {
      title:'राष्ट्रीय किसान परिषद्',
      shortdec:`भारत का किसान समृद्ध था ; अनेकों देश भारत से अनाज, फल, मसाले आयत करते थे | ७०% से अधिक आबादी जिस देश में किसानों की है उस भारत में आज हर दिन १२ किएान कर्जे के कारण आत्महत्या करते है| १७ वर्षों में ३ लाख से ज्यादा और पिछले ३ सालों में ४०००० से ज्यादा किसान आत्महत्या कर मर गए है |`,
      longdesc:`<p>१. सभी किसानों के सभी बैंकों के और अन्य कर्जे माफ़ कर उन्हें कर्जमुक्त किया जाए| सरकारें इनमे किसानों को कागजों और डिजिटल के जंजालों में ना उलझाए| सवकाररों से बड़े ब्याज पर कर्ज लेना किसानों की मज़बूरी केवल सरकारों की संवेदन शून्यता के कारण होती है | सावकार किसानों के बैल , ट्रेक्टर जबरन उठा ले जाते है| सभी साहूकारों के कर्जे भी सरकार स्वयं भरे |
      </p><p>२. किसानों के सभी फसलों पर सी २ (C 2 ) के  से लागत के डेढ़ गुना कीमत किसानों को दी जाये | 
      </p><p>३. फसल बिमा की संपूर्ण रकम किसानों को तुरंत मिले| फसल या जमीन के नुकसान के कारणों का या सरकारी कागजों का निमित्त करके मुआवजा देने में कमी या देरी ना हो |
      </p><p>४. डॉक्टर स्वामीनाथन आयोग की सभी शिफारसों पर तुरंत अमल हो और उसका लाभ सभी किसान को बिना किसी राजनीति के मिले| राष्ट्रीय किसान परिषद् इन मांगों पर हर राज्य के किसानों की स्थानीय समस्याओं के मुद्दों पर और किसानों की समृद्धि , सुरक्षा और सम्मान के लिए किसानों के साथ खड़ी है |</p>`,
      img:'assets/imgs/3.jpg'
    },
    {
      title:'राष्ट्रीय मजदूर परिषद्',
      shortdec:'',
      longdesc:'',
      img:'assets/imgs/2.jpg'
    },
    {
      title:'राष्ट्रीय महिला परिषद्',
      shortdec:`भारत के स्वर्णयुग में भी देश की युवतियां अर्थकारण , धर्मकारण, शास्त्र-शस्त्र, राजनीति सभी में अग्रेसर थी | दुर्गा देवीसे लेकर झांसी रानी तक और जिजाऊमाता से लेकर आज विज्ञान , खेल, राजनीति, कला, सेना इन सभी में अपने कौशल्या और बुद्धिमता से देश का नाम विश्व भर में तेजस्वी करने वाली सभी ओजस्विनी युवतियॉं हर युवती की प्रेरणा है |

      "ओजस्विनी "युवतियों की विश्वसनीय सहेली का काम करेगी|`,
      longdesc:`<p>१. युवतियों को आत्मरक्षा का प्रशिक्षण 
      </p><p>२. शरररिक और मानसिक स्वास्त्य और तनाव इनपर प्रोफेशनल डॉक्टरों और समाज सेवा में विशेषज्ञों द्वारा सलाह केंद्र |
      </p><p>३. काम आयु की शालेय और महाविद्यालयीन युवतियों को बेहला फुसला कर उनपर शारारिक, मानसिक, या सामाजिक अत्याचार और झूठ बोलकर शादियां आदि घटनाये बड़ी है | ऐसे में युवतियों को मानसिक और कानूनी सहायक आधार की व्यवस्था खड़ी करना |
      </p><p>४. शहरी क्षेत्रों की युवातियां और ग्रामीण भारत की युवतियों की समस्याओंका,  आकांशाओंका अलग अलग संज्ञान लेकर उन्हें कानूनी, शिक्षा की , स्वास्थय की आदि मदद मिले यह व्यवस्था |</p>`,
      img:'assets/imgs/5.jpg'
    },
    {
      title:'राष्ट्रीय छात्र परिषद',
      shortdec:'',
      longdesc:'',
      img:'assets/imgs/4.jpg'
    }
  ]
  constructor(public navCtrl: NavController) {

  }

  partydetails(item)
  {
    this.navCtrl.push('PartyDetailsPage',item);
  }

  joinus()
  {
    this.navCtrl.push('JoinNowPage');
  }
}
